{"keras_version": "2.1.5", "config": [{"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 858, 128, 1], "bias_regularizer": null, "kernel_size": [7, 7], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 16, "name": "conv2d_1", "bias_constraint": null, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 32, "name": "conv2d_2", "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 32, "name": "conv2d_3", "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 32, "name": "conv2d_4", "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "max_pooling2d_4", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "filters": 32, "name": "conv2d_transpose_1", "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [256, 54]}, "class_name": "Reshape"}, {"config": {"trainable": true, "unroll": false, "bias_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "use_bias": true, "implementation": 1, "name": "gru_1", "reset_after": false, "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "kernel_constraint": null, "return_state": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "units": 500}, "class_name": "GRU"}, {"config": {"trainable": true, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_5", "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "activation": "softmax", "units": 2, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}