{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_size": [7, 7], "bias_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, 858, 128, 1], "filters": 16, "name": "conv2d_1", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_1", "trainable": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_2", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_2", "trainable": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_3", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_3", "trainable": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dilation_rate": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_4", "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "trainable": true, "pool_size": [3, 3], "strides": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_4", "trainable": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "Conv2DTranspose", "config": {"padding": "valid", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_transpose_1", "data_format": "channels_last"}}, {"class_name": "Reshape", "config": {"target_shape": [256, 54], "trainable": true, "name": "reshape_1"}}, {"class_name": "GRU", "config": {"dropout": 0.0, "recurrent_constraint": null, "bias_regularizer": null, "bias_constraint": null, "reset_after": false, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "gru_1", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "kernel_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "implementation": 1, "units": 500}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "center": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_5", "trainable": true, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.0}}, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 3}}], "keras_version": "2.1.5", "backend": "tensorflow"}