{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"data_format": "channels_last", "batch_input_shape": [null, 858, 128, 1], "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 16, "kernel_size": [7, 7], "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "dtype": "float32", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [3, 3], "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "center": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "kernel_size": [5, 5], "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [3, 3], "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "center": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_2", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [3, 3], "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "center": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_3", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"data_format": "channels_last", "name": "conv2d_4", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [3, 3], "padding": "same", "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "center": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_4", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"activation": "linear", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "name": "conv2d_transpose_1", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid"}, "class_name": "Conv2DTranspose"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [256, 54]}, "class_name": "Reshape"}, {"config": {"go_backwards": false, "return_sequences": false, "implementation": 1, "reset_after": false, "kernel_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "dropout": 0.0, "activation": "tanh", "bias_constraint": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "units": 500, "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "trainable": true, "bias_regularizer": null, "name": "gru_1", "use_bias": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "GRU"}, {"config": {"gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "center": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "name": "batch_normalization_5", "gamma_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"units": 3, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}